---
kind: other
id: Methods.T:Autodesk.Revit.DB.TilePattern
source: html/9dfdd2f6-970b-523a-2c3b-e97f41c53892.htm
---
# TilePattern Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.